package days03;

/**
 * @author KL
 * @date 2023. 7. 17. - 오후 12:19:28
 * @subject 
 * @content
 */
public class Ex05 {

	public static void main(String[] args) {
		
		/*
		 * 1. 연산자  (operator)
		 *     ㄱ. 정의 : 연산을 수행하는 기호
		 *         +, -, *, /, ;, [], () 등등....
		 *        
		 * 2. 피연산자(operand)
		 *     ㄱ. 연산자의 처리(작업) 대상
		 *     ㄴ.  피연산자의 갯수 따라서 연산자 구분
		 *          1개 : 단항 연산자     
		 *          2개 : 이항 연산자     3 + 4 (덧셈연산자-두개의 항 필요)
		 *          3개 : 삼항 연산자
		 *          
		 * 3. 식   (expression)
		 *     ㄱ. 연산자와 피연산자를 조합하여 표현한 것
		 *         예 ) 3 + 4      ,     !4      ,      4 > 3
		 *         
		 * 4. 연산자의 종류 (기능에 따라 종류 나눔)
		 *     ㄱ.  산술 연산자  : + - * /         //Ex05_02.java 파일 확인
		 *     ㄴ.  비교 연산자  :  > < >= <= == != // Ex05_03.java 확인
		 *     ㄷ.  논리 연산자  : Ex05_04.java 확인 
		 *     ㄹ.  대입 연산자
		 *     ㅁ.  기타
		 */
		
		
		
		
		
		
	} //main
	
	
	
}//class
